// 1. ประกาศตัวแปรเก็บข้อมูลส่วนตัวโดยไม่ใช้ var (ใช้ const และ let)
// ประกาศตัวแปรเก็บข้อมูลส่วนตัว
const nickname = "ปอนด์"; // สร้างตัวแปรเก็บชื่อเล่น
const studentId = "67110920"; // สร้างตัวแปรเก็บรหัสนักศึกษา
const age = "21"; // สร้างตัวแปรเก็บอายุ
const major = "วิศวกรรมคอมพิวเตอร์"; // สร้างตัวแปรเก็บสาขาวิชา
const enrolledSubjects = "6" // สร้างตัวแปรจำนวนวิชา


// ส่วนที่ 2 ประกาศตัวแปรคำนวณปีที่จบ
// คำนวณปีที่จะจบ (ต้องระวังให้ตัวเลขเป็นประเภท Number ไม่ใช่ String)
const yearsRemaining = 2;   // จำนวนปีที่เหลือในการเรียน -> // ห้ามใส่เครื่องหมาย " " ครอบตัวเลข
const currentYear = 2569;   // ปี พ.ศ. ที่มาบวกกับปีที่จะจบ -> // ห้ามใส่เครื่องหมาย " " ครอบตัวเลข


// ส่วนที่ 3 แสงผลแนะนำตัวด้วย Template Literal
// แสดงผลบัตรแนะนำตัวด้วย Template Literal
console.log (`===== บัตรแนะนำตัว =====
ชื่อเล่น      : ${nickname}
รหัสนักศึกษา  : ${studentId}
อายุ         : ${age} ปี
สาขาวิชา      : ${major}
ลงทะเบียน    : ${enrolledSubjects} วิชา
ปีที่จะจบ      : ${currentYear + yearsRemaining}
========================`);
