// ประกาศฟังก์ชันค่า Score เข้ามาคำนวณเกรดที่ตั้งกับค่า Score เอาไว้
function toGrade(score) {
    // ตรวจสอบข้อมูลนำเข้า ว่าหลุดที่ตั้งไว้ 0-100 หรือไม่
    if(score < 0 || score > 100) {
        console.log(`คะแนน ${score} -> คะแนนไม่ถูกต้อง ต้องอยู่ระหว่าง 0-100`); // แจ้งเตือนข้อผิดพลาด
        return; // จบการทำงานทันที และสั่งรันใหม่ในบรรทัดถัดไป
    }

    let grade = ''; // ประกาศค่าและเก็บตัวแปรเกรดเอาไว้
// ตรวจสอบเงื่อนไขตามลำดับจากมากไปน้อย
 if(score >= 80){  // ถ้าคะแนนมากกว่าเท่ากับ 80
    grade = 'A'; // จะได้เกรด A
 }   else if(score >=75){ // ถ้าคะแนนมากกว่าเท่ากับ 75
    grade = 'B+'; // จะได้เกรด B+
 }  else if(score >=70){ // -> ตั้งแต่บรรทัดนี้ก็อธิบายเหมือนกันด้านบน  ↓ 
    grade = 'B';
 }  else if(score >=65){ 
    grade = 'C+';
 }  else if(score >=60){
    grade = 'C';
 } else if(score >=55){
    grade = 'D+';
 }  else if(score >=50){
    grade = 'D';
 }  else{
    grade = 'F';
 }

 // แสดงผลลัพธ์คะแนนและเกรดที่ได้ 
 console.log(`คะแนน ${score} -> เกรด ${grade}`);

}

// สร้าง Array รวมชุดข้อมูลที่นำมาทดสอบทั้งหมด 13 ค่า
const testScores = [95,80,79,75,70,65,60,55,50,49,0,-5,120];
// วนลูปค่า score ใน Array ออกมาทีละตัวส่งไปให้toGrade()
for(const score of testScores){
    toGrade(score); // ส่งค่า score แต่ละตัวไปประมวลผล
}